import React from "react";

export default function CookiesPolicy() {
  return (
    <div className="bg-[#EFF4FF]">
      <div className="container max-w-4xl mx-auto md:p-12 p-6 bg-white rounded-lg shadow-md">
        <h1 className="text-3xl font-bold mb-4">Политика в отношении файлов cookie</h1>
        <p className="mb-4">Настоящая Политика в отношении файлов cookie является частью Политики конфиденциальности личных данных (далее – Политика конфиденциальности) и регулирует использование файлов cookie и аналогичных технологий на сайте Интернет-магазина Товарищество с ограниченной ответственностью «DEX&CO» (далее – Продавец).</p>
        <h2 className="text-2xl font-semibold mb-2">1. Определение терминов</h2>
        <p className="mb-2">1.1. Персональные данные - сведения, связанные с упрощением или определением на их основании исторических данных, зафиксированных на электронном, бумажном и (или) материальном носителе.</p>
        <p className="mb-2">1.2. Неличные данные - сведения, которые автоматически передаются в процессе просмотра покупателем рекламных блоков и при посещении страниц, на установленной статистической скриптовой системе: адрес запрашиваемой страницы, информация cookie, IP-адрес, информация о браузере, реферер которого (адрес следующей страницы), время доступа.</p>
        <p className="mb-2">1.3. Сбор цифровых данных - действия, направленные на получение цифровых данных.</p>
        <p className="mb-2">1.4. Обработка цифровых данных - действия, направленные на накопление, хранение, изменение, дополнение, использование, распространение, обезличивание, блокирование и использование цифровых данных.</p>
        <p className="mb-2">1.5. Защита государственных данных - комплекс мер, в том числе правовых, организационных и технических, государственных в целях, установленных Законом РК «О национальных данных и их защите».</p>
        <p className="mb-2">1.6. Интернет-магазин - Интернет-сайт, расположенный в формате г. и Алматы предоставляет адрес в сети Интернет http://www.irocket.kz, на котором представлены товары, предлагаемые Покупателям для оформления Заказов, а также условия оплаты и доставки этих Заказов Покупателям.</p>
        <p className="mb-2">1.7. Сервисы Интернет-сайта – все услуги, доступные для использования на сайте http://www.irocket.kz и поддоменах.</p>
        <p className="mb-2">1.8. Покупатель – пользователь Интернет-магазина.</p>
        <p className="mb-2">1.9. Продавец – Товарищество с ограниченной ответственностью «DEX&CO», являющееся авторитетным Интернет-магазином, БИН 230140039203.</p>
        <p className="mb-2">1.10. Файлы cookie — это небольшие текстовые файлы, которые в браузере записывают данные с посещенных сайтов покупателей. Файлы cookie представляют собой целый ряд функций, например, позволяют Покупателю эффективно перемещаться между страницами, запоминая его настройки и, таким образом, улучшают опыт взаимодействия с Интернет-сайтом http://www.irocket.kz.</p>
        <p className="mb-2">1.11. IP-адрес — уникальный сетевой адрес узла в компьютерной сети, построенный по протоколу IP, позволяющий определить местонахождение Покупателя. Интернет-магазин не отслеживает местоположение.</p>
        <h2 className="text-2xl font-semibold mb-2">2. Использование файлов cookie</h2>
        <p className="mb-2">2.1. Использование файлов cookie позволяет Продавцу улучшить функциональность сайта Интернет-магазина и предоставить Покупателям более персонализированный опыт.</p>
        <p className="mb-2">2.2. Файлы cookie позволяют Покупателю сохранять настройки и предпочтения, упрощают процессы авторизации и позволяют собирать статистические данные о посещениях и использовании сайта.</p>
        <p className="mb-2">2.3. Покупатель может настроить браузер таким образом, чтобы он не принимал файлы cookie, однако это может ограничить доступ к некоторым функциям сайта.</p>
        <h2 className="text-2xl font-semibold mb-2">3. Виды используемых файлов cookie</h2>
        <p className="mb-2">3.1. Продавец использует следующие виды файлов cookie:</p>
        <p className="mb-2">3.1.1. Обязательные файлы cookie – необходимы для правильной работы сайта.</p>
        <p className="mb-2">3.1.2. Функциональные файлы cookie – используются для запоминания предпочтений Покупателя.</p>
        <p className="mb-2">3.1.3. Статистические файлы cookie – помогают собирать анонимные данные о посещениях сайта и анализировать поведение пользователей.</p>
        <p className="mb-2">3.1.4. Рекламные файлы cookie – используются для предоставления Покупателю персонализированной рекламы на основе его интересов.</p>
        <h2 className="text-2xl font-semibold mb-2">4. Управление файлами cookie</h2>
        <p className="mb-2">4.1. Покупатель может управлять файлами cookie через настройки браузера, выбирая опции по их удалению или блокировке.</p>
        <p className="mb-2">4.2. Для получения дополнительной информации о файлах cookie и способах их управления, Покупатель может обратиться к разделу справки браузера или посетить сайт http://www.aboutcookies.org.</p>
        <h2 className="text-2xl font-semibold mb-2">5. Заключительные положения</h2>
        <p className="mb-2">5.1. Использование сайта Интернет-магазина https://www.irocket.kz означает согласие Покупателя с настоящей Политикой в отношении файлов cookie.</p>
        <p className="mb-2">5.2. Продавец оставляет за собой право вносить изменения в настоящую Политику в отношении файлов cookie. Все изменения будут публиковаться на этой странице.</p>
        <p className="mb-2">5.3. По всем вопросам, связанным с настоящей Политикой в отношении файлов cookie, Покупатель может обращаться по телефону 7 747 717 4422.</p>
      </div>
    </div>
  );
}
